
## :white_check_mark: Apply Succeeded

[CI link](https://github.com/mongulu-cm/mtchoun-mouh/actions/runs/7687282999)



<pre><code>Apply complete! Resources: 27 added, 0 changed, 0 destroyed.</code></pre>

<details><summary>Details (Click me)</summary>

```hcl
Running apply in the remote backend. Output will stream here. Pressing Ctrl-C
will cancel the remote apply if it's still pending. If the apply started it
will stop streaming the logs, but will not stop the apply running remotely.

Preparing the remote apply...

To view this run in a browser, visit:
https://app.terraform.io/app/tfc-mongulu-cm/mtchoun-mouh-lambda-layer/runs/run-C91SydgofWXG1idn

Waiting for the plan to start...

Terraform v1.5.4
on linux_amd64
Initializing plugins and modules...
data.archive_file.lambda_zip: Reading...
data.archive_file.lambda_zip: Read complete after 0s [id=7b81d6cecc9c0724d7904143286d423581b9c25e]
data.aws_caller_identity.current: Reading...
data.aws_iam_role.role: Reading...
data.aws_caller_identity.current: Read complete after 0s [id=053932140667]
data.aws_iam_role.role: Read complete after 0s [id=website-deployer]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_api_gateway_deployment.test will be created
  + resource "aws_api_gateway_deployment" "test" {
      + created_date  = (known after apply)
      + execution_arn = (known after apply)
      + id            = (known after apply)
      + invoke_url    = (known after apply)
      + rest_api_id   = (known after apply)
      + stage_name    = "mtchoun-mouh-lambda-layer-dev"
    }

  # aws_api_gateway_integration.integration will be created
  + resource "aws_api_gateway_integration" "integration" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "POST"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + resource_id             = (known after apply)
      + rest_api_id             = (known after apply)
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = (known after apply)
    }

  # aws_api_gateway_method.method will be created
  + resource "aws_api_gateway_method" "method" {
      + api_key_required = false
      + authorization    = "NONE"
      + http_method      = "POST"
      + id               = (known after apply)
      + resource_id      = (known after apply)
      + rest_api_id      = (known after apply)
    }

  # aws_api_gateway_method_response.method_response_200 will be created
  + resource "aws_api_gateway_method_response" "method_response_200" {
      + http_method         = "POST"
      + id                  = (known after apply)
      + resource_id         = (known after apply)
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Headers" = true
          + "method.response.header.Access-Control-Allow-Methods" = false
          + "method.response.header.Access-Control-Allow-Origin"  = true
        }
      + rest_api_id         = (known after apply)
      + status_code         = "200"
    }

  # aws_api_gateway_resource.resource will be created
  + resource "aws_api_gateway_resource" "resource" {
      + id          = (known after apply)
      + parent_id   = (known after apply)
      + path        = (known after apply)
      + path_part   = "register"
      + rest_api_id = (known after apply)
    }

  # aws_api_gateway_rest_api.api will be created
  + resource "aws_api_gateway_rest_api" "api" {
      + api_key_source               = (known after apply)
      + arn                          = (known after apply)
      + binary_media_types           = (known after apply)
      + created_date                 = (known after apply)
      + description                  = "Allow to register user for sending notifications later"
      + disable_execute_api_endpoint = (known after apply)
      + execution_arn                = (known after apply)
      + id                           = (known after apply)
      + minimum_compression_size     = -1
      + name                         = "mtchoun-mouh-lambda-layer-user registration"
      + policy                       = (known after apply)
      + root_resource_id             = (known after apply)
      + tags                         = {
          + "environment" = "mtchoun-mouh-master"
          + "project"     = "mtchoun-mouh"
        }
      + tags_all                     = {
          + "environment" = "mtchoun-mouh-master"
          + "project"     = "mtchoun-mouh"
        }

      + endpoint_configuration {
          + types            = [
              + "REGIONAL",
            ]
          + vpc_endpoint_ids = (known after apply)
        }
    }

  # aws_cloudwatch_event_rule.scheduler will be created
  + resource "aws_cloudwatch_event_rule" "scheduler" {
      + arn                 = (known after apply)
      + description         = "extract image - verify passport is out - send notifications"
      + event_bus_name      = "default"
      + id                  = (known after apply)
      + is_enabled          = true
      + name                = "mtchoun-mouh-lambda-layer-trigger_user_scan"
      + name_prefix         = (known after apply)
      + schedule_expression = "cron(0 8 ? * MON-FRI *)"
      + tags                = {
          + "environment" = "mtchoun-mouh-master"
          + "project"     = "mtchoun-mouh"
        }
      + tags_all            = {
          + "environment" = "mtchoun-mouh-master"
          + "project"     = "mtchoun-mouh"
        }
    }

  # aws_cloudwatch_event_target.target will be created
  + resource "aws_cloudwatch_event_target" "target" {
      + arn            = (known after apply)
      + event_bus_name = "default"
      + id             = (known after apply)
      + rule           = "mtchoun-mouh-lambda-layer-trigger_user_scan"
      + target_id      = "lambda"
    }

  # aws_dynamodb_table.Link_table will be created
  + resource "aws_dynamodb_table" "Link_table" {
      + arn              = (known after apply)
      + billing_mode     = "PROVISIONED"
      + hash_key         = "link"
      + id               = (known after apply)
      + name             = "mtchoun-mouh-lambda-layer-Link_table"
      + read_capacity    = 1
      + stream_arn       = (known after apply)
      + stream_label     = (known after apply)
      + stream_view_type = (known after apply)
      + tags             = {
          + "environment" = "mtchoun-mouh-master"
          + "project"     = "mtchoun-mouh"
        }
      + tags_all         = {
          + "environment" = "mtchoun-mouh-master"
          + "project"     = "mtchoun-mouh"
        }
      + write_capacity   = 1

      + attribute {
          + name = "link"
          + type = "S"
        }

      + point_in_time_recovery {
          + enabled = false
        }
    }

  # aws_dynamodb_table.Register will be created
  + resource "aws_dynamodb_table" "Register" {
      + arn              = (known after apply)
      + billing_mode     = "PROVISIONED"
      + hash_key         = "Name"
      + id               = (known after apply)
      + name             = "mtchoun-mouh-lambda-layer-Register"
      + read_capacity    = 1
      + stream_arn       = (known after apply)
      + stream_label     = (known after apply)
      + stream_view_type = (known after apply)
      + tags             = {
          + "environment" = "mtchoun-mouh-master"
          + "project"     = "mtchoun-mouh"
        }
      + tags_all         = {
          + "environment" = "mtchoun-mouh-master"
          + "project"     = "mtchoun-mouh"
        }
      + write_capacity   = 1

      + attribute {
          + name = "Name"
          + type = "S"
        }

      + point_in_time_recovery {
          + enabled = false
        }
    }

  # aws_dynamodb_table.Users will be created
  + resource "aws_dynamodb_table" "Users" {
      + arn              = (known after apply)
      + billing_mode     = "PROVISIONED"
      + hash_key         = "UserName"
      + id               = (known after apply)
      + name             = "mtchoun-mouh-lambda-layer-Users"
      + read_capacity    = 1
      + stream_arn       = (known after apply)
      + stream_label     = (known after apply)
      + stream_view_type = (known after apply)
      + tags             = {
          + "environment" = "mtchoun-mouh-master"
          + "project"     = "mtchoun-mouh"
        }
      + tags_all         = {
          + "environment" = "mtchoun-mouh-master"
          + "project"     = "mtchoun-mouh"
        }
      + write_capacity   = 1

      + attribute {
          + name = "UserName"
          + type = "S"
        }

      + point_in_time_recovery {
          + enabled = false
        }
    }

  # aws_lambda_function.lambda will be created
  + resource "aws_lambda_function" "lambda" {
      + arn                            = (known after apply)
      + filename                       = "api/lambda.zip"
      + function_name                  = "mtchoun-mouh-lambda-layer-user_registration_consulcam"
      + handler                        = "lambda.register_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + layers                         = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = "arn:aws:iam::053932140667:role/website-deployer"
      + runtime                        = "python3.8"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + source_code_hash               = "e2ufzPH1fm1YKjl/alhoIobY0clxFKvSfI9g6qdn0/Y="
      + source_code_size               = (known after apply)
      + tags                           = {
          + "environment" = "mtchoun-mouh-master"
          + "project"     = "mtchoun-mouh"
        }
      + tags_all                       = {
          + "environment" = "mtchoun-mouh-master"
          + "project"     = "mtchoun-mouh"
        }
      + timeout                        = 10
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "API_KEY"         = (sensitive value)
              + "BUCKET_NAME"     = "mtchoun-mouh-lambda-layer-djansang"
              + "ENV"             = "mtchoun-mouh-lambda-layer"
              + "LINKS_TABLE"     = "mtchoun-mouh-lambda-layer-Link_table"
              + "MAINTAINER_MAIL" = (sensitive value)
              + "REGION"          = "eu-central-1"
              + "REGISTERS_TABLE" = "mtchoun-mouh-lambda-layer-Register"
              + "SENTRY_DNS"      = (sensitive value)
              + "USERS_TABLE"     = "mtchoun-mouh-lambda-layer-Users"
            }
        }
    }

  # aws_lambda_function.scan will be created
  + resource "aws_lambda_function" "scan" {
      + arn                            = (known after apply)
      + filename                       = "api/lambda.zip"
      + function_name                  = "mtchoun-mouh-lambda-layer-scan_user_consulcam"
      + handler                        = "lambda.scan_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = "arn:aws:iam::053932140667:role/website-deployer"
      + runtime                        = "python3.8"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + source_code_hash               = "e2ufzPH1fm1YKjl/alhoIobY0clxFKvSfI9g6qdn0/Y="
      + source_code_size               = (known after apply)
      + tags                           = {
          + "environment" = "mtchoun-mouh-master"
          + "project"     = "mtchoun-mouh"
        }
      + tags_all                       = {
          + "environment" = "mtchoun-mouh-master"
          + "project"     = "mtchoun-mouh"
        }
      + timeout                        = 900
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "API_KEY"         = (sensitive value)
              + "BUCKET_NAME"     = "mtchoun-mouh-lambda-layer-djansang"
              + "ENV"             = "mtchoun-mouh-lambda-layer"
              + "LINKS_TABLE"     = "mtchoun-mouh-lambda-layer-Link_table"
              + "MAINTAINER_MAIL" = (sensitive value)
              + "REGION"          = "eu-central-1"
              + "REGISTERS_TABLE" = "mtchoun-mouh-lambda-layer-Register"
              + "SENTRY_DNS"      = (sensitive value)
              + "USERS_TABLE"     = "mtchoun-mouh-lambda-layer-Users"
            }
        }
    }

  # aws_lambda_layer_version.test_lambda_layer will be created
  + resource "aws_lambda_layer_version" "test_lambda_layer" {
      + arn                         = (known after apply)
      + compatible_runtimes         = [
          + "python3.7",
          + "python3.8",
        ]
      + created_date                = (known after apply)
      + filename                    = "python.zip"
      + id                          = (known after apply)
      + layer_arn                   = (known after apply)
      + layer_name                  = "test_lambda_layer"
      + signing_job_arn             = (known after apply)
      + signing_profile_version_arn = (known after apply)
      + source_code_hash            = (known after apply)
      + source_code_size            = (known after apply)
      + version                     = (known after apply)
    }

  # aws_lambda_permission.allow_cloudwatch_to_call_check_foo will be created
  + resource "aws_lambda_permission" "allow_cloudwatch_to_call_check_foo" {
      + action        = "lambda:InvokeFunction"
      + function_name = "mtchoun-mouh-lambda-layer-scan_user_consulcam"
      + id            = (known after apply)
      + principal     = "events.amazonaws.com"
      + source_arn    = (known after apply)
      + statement_id  = "AllowExecutionFromCloudWatch"
    }

  # aws_lambda_permission.apigw_lambda will be created
  + resource "aws_lambda_permission" "apigw_lambda" {
      + action        = "lambda:InvokeFunction"
      + function_name = "mtchoun-mouh-lambda-layer-user_registration_consulcam"
      + id            = (known after apply)
      + principal     = "apigateway.amazonaws.com"
      + source_arn    = (known after apply)
      + statement_id  = "AllowExecutionFromAPIGateway"
    }

  # aws_s3_bucket.images will be created
  + resource "aws_s3_bucket" "images" {
      + acceleration_status         = (known after apply)
      + acl                         = "private"
      + arn                         = (known after apply)
      + bucket                      = "mtchoun-mouh-lambda-layer-djansang"
      + bucket_domain_name          = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = true
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "Name"        = "images"
          + "environment" = "mtchoun-mouh-master"
          + "project"     = "mtchoun-mouh"
        }
      + tags_all                    = {
          + "Name"        = "images"
          + "environment" = "mtchoun-mouh-master"
          + "project"     = "mtchoun-mouh"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
    }

  # aws_s3_bucket.website will be created
  + resource "aws_s3_bucket" "website" {
      + acceleration_status         = (known after apply)
      + acl                         = "private"
      + arn                         = (known after apply)
      + bucket                      = "mtchoun-mouh-lambda-layer-mtchoun-mouh.mongulu.cm"
      + bucket_domain_name          = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = true
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "Name"        = "Website"
          + "environment" = "mtchoun-mouh-master"
          + "project"     = "mtchoun-mouh"
        }
      + tags_all                    = {
          + "Name"        = "Website"
          + "environment" = "mtchoun-mouh-master"
          + "project"     = "mtchoun-mouh"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + cors_rule {
          + allowed_headers = [
              + "*",
            ]
          + allowed_methods = [
              + "PUT",
              + "POST",
              + "GET",
            ]
          + allowed_origins = [
              + "*",
            ]
        }

      + website {
          + error_document = "error.html"
          + index_document = "index.html"
        }
    }

  # aws_s3_bucket_object.example_file will be created
  + resource "aws_s3_bucket_object" "example_file" {
      + acl                    = "private"
      + bucket                 = (known after apply)
      + bucket_key_enabled     = (known after apply)
      + content_type           = "text/html"
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "index.html"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "../html/index.html"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # aws_s3_bucket_policy.website will be created
  + resource "aws_s3_bucket_policy" "website" {
      + bucket = (known after apply)
      + id     = (known after apply)
      + policy = (known after apply)
    }

  # aws_s3_bucket_public_access_block.website will be created
  + resource "aws_s3_bucket_public_access_block" "website" {
      + block_public_acls       = false
      + block_public_policy     = false
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = false
      + restrict_public_buckets = false
    }

  # local_file.index_page will be created
  + resource "local_file" "index_page" {
      + content              = (sensitive value)
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "../html/index.html"
      + id                   = (known after apply)
    }

  # null_resource.lambda_layer will be

# ...
# ... The maximum length of GitHub Comment is 65536, so the content is omitted by tfcmt.
# ...

      413  python/lib/python3.8/site-pakages/urllib3/util/__init__.py
null_resource.lambda_layer (local-exec): 2024-01-28 17:21:43 D....            0            0  python/lib/python3.8/site-pakages/urllib3/util/__pycache__
null_resource.lambda_layer (local-exec): 2024-01-28 17:21:43 .....          931          614  python/lib/python3.8/site-pakages/urllib3/util/__pycache__/__init__.cpython-38.pyc
null_resource.lambda_layer (local-exec): 2024-01-28 17:21:43 .....         3394         1989  python/lib/python3.8/site-pakages/urllib3/util/__pycache__/connection.cpython-38.pyc
null_resource.lambda_layer (local-exec): 2024-01-28 17:21:43 .....         1027          634  python/lib/python3.8/site-pakages/urllib3/util/__pycache__/proxy.cpython-38.pyc
null_resource.lambda_layer (local-exec): 2024-01-28 17:21:43 .....         6057         3252  python/lib/python3.8/site-pakages/urllib3/util/__pycache__/request.cpython-38.pyc
null_resource.lambda_layer (local-exec): 2024-01-28 17:21:43 .....         2285         1278  python/lib/python3.8/site-pakages/urllib3/util/__pycache__/response.cpython-38.pyc
null_resource.lambda_layer (local-exec): 2024-01-28 17:21:43 .....        15212         6561  python/lib/python3.8/site-pakages/urllib3/util/__pycache__/retry.cpython-38.pyc
null_resource.lambda_layer (local-exec): 2024-01-28 17:21:43 .....        11886         5904  python/lib/python3.8/site-pakages/urllib3/util/__pycache__/ssl_.cpython-38.pyc
null_resource.lambda_layer (local-exec): 2024-01-28 17:21:43 .....         3625         2147  python/lib/python3.8/site-pakages/urllib3/util/__pycache__/ssl_match_hostname.cpython-38.pyc
null_resource.lambda_layer (local-exec): 2024-01-28 17:21:43 .....         9269         4161  python/lib/python3.8/site-pakages/urllib3/util/__pycache__/ssltransport.cpython-38.pyc
null_resource.lambda_layer (local-exec): 2024-01-28 17:21:43 .....         9671         3875  python/lib/python3.8/site-pakages/urllib3/util/__pycache__/timeout.cpython-38.pyc
null_resource.lambda_layer (local-exec): 2024-01-28 17:21:43 .....        11052         5654  python/lib/python3.8/site-pakages/urllib3/util/__pycache__/url.cpython-38.pyc
null_resource.lambda_layer (local-exec): 2024-01-28 17:21:43 .....         1208          700  python/lib/python3.8/site-pakages/urllib3/util/__pycache__/util.cpython-38.pyc
null_resource.lambda_layer (local-exec): 2024-01-28 17:21:43 .....         2359         1235  python/lib/python3.8/site-pakages/urllib3/util/__pycache__/wait.cpython-38.pyc
null_resource.lambda_layer (local-exec): 2024-01-28 17:21:43 .....         4462         1724  python/lib/python3.8/site-pakages/urllib3/util/connection.py
null_resource.lambda_layer (local-exec): 2024-01-28 17:21:43 .....         1148          481  python/lib/python3.8/site-pakages/urllib3/util/proxy.py
null_resource.lambda_layer (local-exec): 2024-01-28 17:21:43 .....         8072         2780  python/lib/python3.8/site-pakages/urllib3/util/request.py
null_resource.lambda_layer (local-exec): 2024-01-28 17:21:43 .....         3374         1299  python/lib/python3.8/site-pakages/urllib3/util/response.py
null_resource.lambda_layer (local-exec): 2024-01-28 17:21:43 .....        18384         5183  python/lib/python3.8/site-pakages/urllib3/util/retry.py
null_resource.lambda_layer (local-exec): 2024-01-28 17:21:43 .....        19291         5929  python/lib/python3.8/site-pakages/urllib3/util/ssl_.py
null_resource.lambda_layer (local-exec): 2024-01-28 17:21:43 .....         5812         2265  python/lib/python3.8/site-pakages/urllib3/util/ssl_match_hostname.py
null_resource.lambda_layer (local-exec): 2024-01-28 17:21:43 .....         9034         2560  python/lib/python3.8/site-pakages/urllib3/util/ssltransport.py
null_resource.lambda_layer (local-exec): 2024-01-28 17:21:43 .....        10518         3119  python/lib/python3.8/site-pakages/urllib3/util/timeout.py
null_resource.lambda_layer (local-exec): 2024-01-28 17:21:43 .....        15213         4797  python/lib/python3.8/site-pakages/urllib3/util/url.py
null_resource.lambda_layer (local-exec): 2024-01-28 17:21:43 .....         1146          389  python/lib/python3.8/site-pakages/urllib3/util/util.py
null_resource.lambda_layer (local-exec): 2024-01-28 17:21:43 .....         4423         1610  python/lib/python3.8/site-pakages/urllib3/util/wait.py
null_resource.lambda_layer (local-exec): 2024-01-28 17:21:43 D....            0            0  python/lib/python3.8/site-pakages/urllib3-2.1.0.dist-info
null_resource.lambda_layer (local-exec): 2024-01-28 17:21:43 .....            4            4  python/lib/python3.8/site-pakages/urllib3-2.1.0.dist-info/INSTALLER
null_resource.lambda_layer (local-exec): 2024-01-28 17:21:43 .....         6372         2460  python/lib/python3.8/site-pakages/urllib3-2.1.0.dist-info/METADATA
null_resource.lambda_layer (local-exec): 2024-01-28 17:21:43 .....         4167         1743  python/lib/python3.8/site-pakages/urllib3-2.1.0.dist-info/RECORD
null_resource.lambda_layer (local-exec): 2024-01-28 17:21:43 .....           87           86  python/lib/python3.8/site-pakages/urllib3-2.1.0.dist-info/WHEEL
null_resource.lambda_layer (local-exec): 2024-01-28 17:21:43 D....            0            0  python/lib/python3.8/site-pakages/urllib3-2.1.0.dist-info/licenses
null_resource.lambda_layer (local-exec): 2024-01-28 17:21:43 .....         1093          645  python/lib/python3.8/site-pakages/urllib3-2.1.0.dist-info/licenses/LICENSE.txt
null_resource.lambda_layer (local-exec): 2024-01-28 17:21:44 D....            0            0  python/lib/python3.8/site-pakages/yaml
null_resource.lambda_layer (local-exec): 2024-01-28 17:21:44 .....        12012         2295  python/lib/python3.8/site-pakages/yaml/__init__.py
null_resource.lambda_layer (local-exec): 2024-01-28 17:21:44 D....            0            0  python/lib/python3.8/site-pakages/yaml/__pycache__
null_resource.lambda_layer (local-exec): 2024-01-28 17:21:44 .....        11428         3875  python/lib/python3.8/site-pakages/yaml/__pycache__/__init__.cpython-38.pyc
null_resource.lambda_layer (local-exec): 2024-01-28 17:21:44 .....         3569         1637  python/lib/python3.8/site-pakages/yaml/__pycache__/composer.cpython-38.pyc
null_resource.lambda_layer (local-exec): 2024-01-28 17:21:44 .....        19631         7316  python/lib/python3.8/site-pakages/yaml/__pycache__/constructor.cpython-38.pyc
null_resource.lambda_layer (local-exec): 2024-01-28 17:21:44 .....         3412         1083  python/lib/python3.8/site-pakages/yaml/__pycache__/cyaml.cpython-38.pyc
null_resource.lambda_layer (local-exec): 2024-01-28 17:21:44 .....         1829          734  python/lib/python3.8/site-pakages/yaml/__pycache__/dumper.cpython-38.pyc
null_resource.lambda_layer (local-exec): 2024-01-28 17:21:44 .....        25359        10019  python/lib/python3.8/site-pakages/yaml/__pycache__/emitter.cpython-38.pyc
null_resource.lambda_layer (local-exec): 2024-01-28 17:21:44 .....         2306         1206  python/lib/python3.8/site-pakages/yaml/__pycache__/error.cpython-38.pyc
null_resource.lambda_layer (local-exec): 2024-01-28 17:21:44 .....         3980         1339  python/lib/python3.8/site-pakages/yaml/__pycache__/events.cpython-38.pyc
null_resource.lambda_layer (local-exec): 2024-01-28 17:21:44 .....         2170          664  python/lib/python3.8/site-pakages/yaml/__pycache__/loader.cpython-38.pyc
null_resource.lambda_layer (local-exec): 2024-01-28 17:21:44 .....         1731          722  python/lib/python3.8/site-pakages/yaml/__pycache__/nodes.cpython-38.pyc
null_resource.lambda_layer (local-exec): 2024-01-28 17:21:44 .....        11930         4435  python/lib/python3.8/site-pakages/yaml/__pycache__/parser.cpython-38.pyc
null_resource.lambda_layer (local-exec): 2024-01-28 17:21:44 .....         4543         2318  python/lib/python3.8/site-pakages/yaml/__pycache__/reader.cpython-38.pyc
null_resource.lambda_layer (local-exec): 2024-01-28 17:21:44 .....        10088         4115  python/lib/python3.8/site-pakages/yaml/__pycache__/representer.cpython-38.pyc
null_resource.lambda_layer (local-exec): 2024-01-28 17:21:44 .....         5484         2585  python/lib/python3.8/site-pakages/yaml/__pycache__/resolver.cpython-38.pyc
null_resource.lambda_layer (local-exec): 2024-01-28 17:21:44 .....        25275         9425  python/lib/python3.8/site-pakages/yaml/__pycache__/scanner.cpython-38.pyc
null_resource.lambda_layer (local-exec): 2024-01-28 17:21:44 .....         3326         1664  python/lib/python3.8/site-pakages/yaml/__pycache__/serializer.cpython-38.pyc
null_resource.lambda_layer (local-exec): 2024-01-28 17:21:44 .....         4941         1581  python/lib/python3.8/site-pakages/yaml/__pycache__/tokens.cpython-38.pyc
null_resource.lambda_layer (local-exec): 2024-01-28 17:21:44 .....         4883         1038  python/lib/python3.8/site-pakages/yaml/composer.py
null_resource.lambda_layer (local-exec): 2024-01-28 17:21:44 .....        27187         4445  python/lib/python3.8/site-pakages/yaml/constructor.py
null_resource.lambda_layer (local-exec): 2024-01-28 17:21:44 .....         3846          513  python/lib/python3.8/site-pakages/yaml/cyaml.py
null_resource.lambda_layer (local-exec): 2024-01-28 17:21:44 .....         2837          385  python/lib/python3.8/site-pakages/yaml/dumper.py
null_resource.lambda_layer (local-exec): 2024-01-28 17:21:44 .....        43006         6558  python/lib/python3.8/site-pakages/yaml/emitter.py
null_resource.lambda_layer (local-exec): 2024-01-28 17:21:44 .....         2533          718  python/lib/python3.8/site-pakages/yaml/error.py
null_resource.lambda_layer (local-exec): 2024-01-28 17:21:44 .....         2445          526  python/lib/python3.8/site-pakages/yaml/events.py
null_resource.lambda_layer (local-exec): 2024-01-28 17:21:44 .....         2061          405  python/lib/python3.8/site-pakages/yaml/loader.py
null_resource.lambda_layer (local-exec): 2024-01-28 17:21:44 .....         1440          388  python/lib/python3.8/site-pakages/yaml/nodes.py
null_resource.lambda_layer (local-exec): 2024-01-28 17:21:44 .....        25495         3678  python/lib/python3.8/site-pakages/yaml/parser.py
null_resource.lambda_layer (local-exec): 2024-01-28 17:21:44 .....         6794         1832  python/lib/python3.8/site-pakages/yaml/reader.py
null_resource.lambda_layer (local-exec): 2024-01-28 17:21:44 .....        14189         2888  python/lib/python3.8/site-pakages/yaml/representer.py
null_resource.lambda_layer (local-exec): 2024-01-28 17:21:44 .....         8970         2132  python/lib/python3.8/site-pakages/yaml/resolver.py
null_resource.lambda_layer (local-exec): 2024-01-28 17:21:44 .....        51277         8869  python/lib/python3.8/site-pakages/yaml/scanner.py
null_resource.lambda_layer (local-exec): 2024-01-28 17:21:44 .....         4165          900  python/lib/python3.8/site-pakages/yaml/serializer.py
null_resource.lambda_layer (local-exec): 2024-01-28 17:21:44 .....         2573          561  python/lib/python3.8/site-pakages/yaml/tokens.py
null_resource.lambda_layer (local-exec): 2024-01-28 17:21:44 D....            0            0  python/lib/python3.8/site-pakages/zulip
null_resource.lambda_layer (local-exec): 2024-01-28 17:21:43 .....        62777        13111  python/lib/python3.8/site-pakages/zulip/__init__.py
null_resource.lambda_layer (local-exec): 2024-01-28 17:21:44 D....            0            0  python/lib/python3.8/site-pakages/zulip/__pycache__
null_resource.lambda_layer (local-exec): 2024-01-28 17:21:43 .....        47411        16645  python/lib/python3.8/site-pakages/zulip/__pycache__/__init__.cpython-38.pyc
null_resource.lambda_layer (local-exec): 2024-01-28 17:21:43 .....          980          654  python/lib/python3.8/site-pakages/zulip/__pycache__/api_examples.cpython-38.pyc
null_resource.lambda_layer (local-exec): 2024-01-28 17:21:43 .....         4394         2075  python/lib/python3.8/site-pakages/zulip/__pycache__/cli.cpython-38.pyc
null_resource.lambda_layer (local-exec): 2024-01-28 17:21:43 .....         2747         1591  python/lib/python3.8/site-pakages/zulip/__pycache__/send.cpython-38.pyc
null_resource.lambda_layer (local-exec): 2024-01-28 17:21:43 .....          919          432  python/lib/python3.8/site-pakages/zulip/api_examples.py
null_resource.lambda_layer (local-exec): 2024-01-28 17:21:43 .....         4876         1395  python/lib/python3.8/site-pakages/zulip/cli.py
null_resource.lambda_layer (local-exec): 2024-01-28 17:21:44 D....            0            0  python/lib/python3.8/site-pakages/zulip/examples
null_resource.lambda_layer (local-exec): 2024-01-28 17:21:43 .....          752          327  python/lib/python3.8/site-pakages/zulip/examples/alert-words
null_resource.lambda_layer (local-exec): 2024-01-28 17:21:43 .....         1142          483  python/lib/python3.8/site-pakages/zulip/examples/create-user
null_resource.lambda_layer (local-exec): 2024-01-28 17:21:43 .....          450          254  python/lib/python3.8/site-pakages/zulip/examples/delete-message
null_resource.lambda_layer (local-exec): 2024-01-28 17:21:43 .....          364          210  python/lib/python3.8/site-pakages/zulip/examples/delete-stream
null_resource.lambda_layer (local-exec): 2024-01-28 17:21:43 .....          981          456  python/lib/python3.8/site-pakages/zulip/examples/edit-message
null_resource.lambda_layer (local-exec): 2024-01-28 17:21:43 .....         1334          493  python/lib/python3.8/site-pakages/zulip/examples/edit-stream
null_resource.lambda_layer (local-exec): 2024-01-28 17:21:43 .....         2037          903  python/lib/python3.8/site-pakages/zulip/examples/get-history
null_resource.lambda_layer (local-exec): 2024-01-28 17:21:43 .....         1456          508  python/lib/python3.8/site-pakages/zulip/examples/get-messages
null_resource.lambda_layer (local-exec): 2024-01-28 17:21:43 .....          490          297  python/lib/python3.8/site-pakages/zulip/examples/get-public-streams
null_resource.lambda_layer (local-exec): 2024-01-28 17:21:43 .....          384          221  python/lib/python3.8/site-pakages/zulip/examples/get-raw-message
null_resource.lambda_layer (local-exec): 2024-01-28 17:21:43 .....          416          239  python/lib/python3.8/site-pakages/zulip/examples/get-stream-topics
null_resource.lambda_layer (local-exec): 2024-01-28 17:21:43 .....          450          270  python/lib/python3.8/site-pakages/zulip/examples/get-subscriptions
null_resource.lambda_layer (local-exec): 2024-01-28 17:21:43 .....          402          238  python/lib/python3.8/site-pakages/zulip/examples/get-user-presence
null_resource.lambda_layer (local-exec): 2024-01-28 17:21:43 .....          509          311  python/lib/python3.8/site-pakages/zulip/examples/list-users
null_resource.lambda_layer (local-exec): 2024-01-28 17:21:43 .....          386          220  python/lib/python3.8/site-pakages/zulip/examples/message-history
null_resource.lambda_layer (local-exec): 2024-01-28 17:21:43 .....          645          333  python/lib/python3.8/site-pakages/zulip/examples/mute-topic
null_resource.lambda_layer (local-exec): 2024-01-28 17:21:43 .....          832          475  python/lib/python3.8/site-pakages/zulip/examples/print-events
null_resource.lambda_layer (local-exec): 2024-01-28 17:21:43 .....          641          376  python/lib/python3.8/site-pakages/zulip/examples/print-messages
null_resource.lambda_layer (local-exec): 2024-01-28 17:21:43 .....          296          185  python/lib/python3.8/site-pakages/zulip/examples/realm-emoji
null_resource.lambda_layer (local-exec): 2024-01-28 17:21:43 .....          837          366  python/lib/python3.8/site-pakages/zulip/examples/send-message
null_resource.lambda_layer (local-exec): 2024-01-28 17:21:43 .....          644          353  python/lib/python3.8/site-pakages/zulip/examples/subscribe
null_resource.lambda_layer (local-exec): 2024-01-28 17:21:43 .....          614          342  python/lib/python3.8/site-pakages/zulip/examples/unsubscribe
null_resource.lambda_layer (local-exec): 2024-01-28 17:21:43 .....          660          332  python/lib/python3.8/site-pakages/zulip/examples/update-message-flags
null_resource.lambda_layer (local-exec): 2024-01-28 17:21:43 .....         1025          560  python/lib/python3.8/site-pakages/zulip/examples/upload-file
null_resource.lambda_layer (local-exec): 2024-01-28 17:21:43 .....         4632         1879  python/lib/python3.8/site-pakages/zulip/examples/welcome-message
null_resource.lambda_layer (local-exec): 2024-01-28 17:21:43 .....          118          100  python/lib/python3.8/site-pakages/zulip/examples/zuliprc
null_resource.lambda_layer (local-exec): 2024-01-28 17:21:43 .....            0            0  python/lib/python3.8/site-pakages/zulip/py.typed
null_resource.lambda_layer (local-exec): 2024-01-28 17:21:43 .....         3285         1163  python/lib/python3.8/site-pakages/zulip/send.py
null_resource.lambda_layer (local-exec): 2024-01-28 17:21:44 D....            0            0  python/lib/python3.8/site-pakages/zulip-0.8.2.dist-info
null_resource.lambda_layer (local-exec): 2024-01-28 17:21:44 .....            4            4  python/lib/python3.8/site-pakages/zulip-0.8.2.dist-info/INSTALLER
null_resource.lambda_layer (local-exec): 2024-01-28 17:21:43 .....         7143         2904  python/lib/python3.8/site-pakages/zulip-0.8.2.dist-info/METADATA
null_resource.lambda_layer (local-exec): 2024-01-28 17:21:44 .....        21824         5402  python/lib/python3.8/site-pakages/zulip-0.8.2.dist-info/RECORD
null_resource.lambda_layer (local-exec): 2024-01-28 17:21:43 .....           92           92  python/lib/python3.8/site-pakages/zulip-0.8.2.dist-info/WHEEL
null_resource.lambda_layer (local-exec): 2024-01-28 17:21:43 .....          191          116  python/lib/python3.8/site-pakages/zulip-0.8.2.dist-info/entry_points.txt
null_resource.lambda_layer (local-exec): 2024-01-28 17:21:43 .....           19           19  python/lib/python3.8/site-pakages/zulip-0.8.2.dist-info/top_level.txt
null_resource.lambda_layer (local-exec): 2024-01-28 17:21:36 .....          209          143  python/pyvenv.cfg
null_resource.lambda_layer (local-exec): ------------------- ----- ------------ ------------  ------------------------
null_resource.lambda_layer (local-exec): 2024-01-28 17:21:52           53885580     25059815  3733 files, 1125 folders
null_resource.lambda_layer: Creation complete after 25s [id=3950035807611253355]
aws_lambda_layer_version.test_lambda_layer: Creating...
aws_lambda_layer_version.test_lambda_layer: Still creating... [10s elapsed]
aws_lambda_layer_version.test_lambda_layer: Creation complete after 11s [id=arn:aws:lambda:eu-central-1:053932140667:layer:test_lambda_layer:2]
aws_lambda_function.lambda: Creating...
aws_lambda_function.lambda: Still creating... [10s elapsed]
aws_lambda_function.lambda: Creation complete after 13s [id=mtchoun-mouh-lambda-layer-user_registration_consulcam]
aws_lambda_permission.apigw_lambda: Creating...
aws_api_gateway_integration.integration: Creating...
aws_api_gateway_integration.integration: Creation complete after 0s [id=agi-x39p7g4q75-0b0r7n-POST]
aws_api_gateway_deployment.test: Creating...
aws_lambda_permission.apigw_lambda: Creation complete after 1s [id=AllowExecutionFromAPIGateway]
aws_api_gateway_deployment.test: Creation complete after 1s [id=kr3srx]
local_file.index_page: Creating...
local_file.index_page: Creation complete after 0s [id=55729a2dd1485c063219a90ad0a7233dd13aa70a]
aws_s3_bucket_object.example_file: Creating...
aws_s3_bucket_object.example_file: Creation complete after 2s [id=index.html]

Apply complete! Resources: 27 added, 0 changed, 0 destroyed.

Outputs:

register_table = "mtchoun-mouh-lambda-layer-Register"
stage_url = "https://x39p7g4q75.execute-api.eu-central-1.amazonaws.com/mtchoun-mouh-lambda-layer-dev"
website_url = "http://mtchoun-mouh-lambda-layer-mtchoun-mouh.mongulu.cm.s3-website.eu-central-1.amazonaws.com"

```

</details>

<!-- github-comment: {"Command":"apply","JobName":"deploy","PRNumber":144,"Program":"tfcmt","SHA1":"8eb574bd9b095bc88e48407ad4ed8d1889c269d1","Vars":{},"WorkflowName":"Deploy cases"} -->